package основы_java.Основные_типы_данных.Ввод_данных_с_клавиатуры;

/*Создайте две переменные: целого типа a и действительного b, равные 5 и 0.4 соответственно. Выведите построчно на экран их сумму, разность, произведение и частное.*/
public class task1 {
    public static void main(String []args){
        int a=5;
        double b = 0.4;

        System.out.println(a+b);
        System.out.println(a-b);
        System.out.println(a*b);
        System.out.println(a/b);
    }
}
